# Дано целое положительное число. Проверить истинность высказывания: «Данное число является нечетным трехзначным»
n = input("Введите целое положительное число: ")
while type(n) != int:
    try:
        n = int(n)
        if n <= 0:
            print("Число должно быть положительным!")
            n = input("Введите целое положительное число: ")
    except ValueError:
        print("Неправильно ввели!")
        n = input("Введите целое положительное число: ")
if 100 <= n <= 999 and n % 2 != 0:
    print("Правда")
else:
    print("Ложь")
